Tekla Open API Reference for Tekla Structures 2025
StructuresInstallation.InstallFolder Property
Note: This API is now obsolete.
 Gets path to Tekla Structures installation directory.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Please Use BinFolder or EnvBaseFolder Folder for normal install folders")]
public static string InstallFolder { get; }
<ObsoleteAttribute("Please Use BinFolder or EnvBaseFolder Folder for normal install folders")>
Public Shared ReadOnly Property InstallFolder As String
	Get
Property Value
Type: String
See Also
Reference
StructuresInstallation Class
Tekla.Structures.Dialog Namespace